<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0de927501a8866ee02e7d3b7d0ef4635e57c9544d809530cc4b4f3e0ebfbaaee","plan_job_ref":"Job Create terraform plan #36 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7065987306","plan_hash":"cc80d463950cba80e97c2282855c95414120d6bbf6ab20ac2e19bd963a400841","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/523b4d4d2277e6ca218a61d42d4285e6b69b791a90aeb23d67a35ba70269fe1e.zip" -> "builds/7403325739338dc7f0011f0ef4e2a3aaa08d8824b45cd5ff97da6200170253cc.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-11-27T22:48:23.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:22/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "22" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "22" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/7403325739338dc7f0011f0ef4e2a3aaa08d8824b45cd5ff97da6200170253cc.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7403325739338dc7f0011f0ef4e2a3aaa08d8824b45cd5ff97da6200170253cc.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/523b4d4d2277e6ca218a61d42d4285e6b69b791a90aeb23d67a35ba70269fe1e.zip" -> "builds/7403325739338dc7f0011f0ef4e2a3aaa08d8824b45cd5ff97da6200170253cc.zip"
          ~ "timestamp" = "1701125293105834000" -> "1701470605464963000"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #36](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7065987306)